In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    'A': ['John', 'Boby', 'Mina', 'Peter', 'Nicky'],
    'B': ['Masters', 'Graduate', 'Graduate', 'Masters', 'Graduate'],
    'C': [27, 23, 21, 23, 24]
})

In [5]:
df

       A         B   C
0   John   Masters  27
1   Boby  Graduate  23
2   Mina  Graduate  21
3  Peter   Masters  23
4  Nicky  Graduate  24

In [7]:
pd.pivot_table(df, index=['A', 'B'])

                 C
A     B
Boby  Graduate  23
John  Masters   27
Mina  Graduate  21
Nicky Graduate  24
Peter Masters   23

In [8]:
pd.pivot_table(df, values='C', index='C', columns='B', aggfunc='sum')

B  Graduate Masters
C
21     Mina     NaN
23     Boby   Peter
24    Nicky     NaN
27      NaN    John